Repository: osaurus-ai/osaurus
Catalog: Packages/OsaurusCore/Resources/Localizable.xcstrings
Source language: en
Languages: ko, ru, zh_hans, zh_hant

source: This deletes your signature, every agent's derived address, and every access key. Onboarding will start over. The backup in your iCloud Keychain will also be removed.
ko: 서명, 모든 에이전트의 파생 주소 및 모든 액세스 키가 삭제됩니다. 시작하기가 처음부터 다시 시작됩니다. iCloud 키체인의 백업도 제거됩니다.
ru: При этом будет удалена ваша подпись, производный адрес каждого агента и каждый ключ доступа. Регистрация начнется заново. Резервная копия в вашей Связке ключей iCloud также будет удалена.
zh_hans: 这将删除你的签名、每个智能体派生的地址以及每个访问密钥。初始设置将重新开始。你 iCloud 钥匙串中的备份也将被移除。
zh_hant: 這將刪除你的籤名、每個智能體派生的地址以及每個訪問密鑰。初始設置將重新開始。你 iCloud 鑰匙串中的備份也將被移除。

source: This field is required
ko: 이 필드는 필수입니다
ru: Это поле обязательно к заполнению
zh_hans: 此字段为必填项
zh_hant: 此字段爲必填項

source: This folder is empty
ko: 이 폴더는 비어 있음
ru: Эта папка пуста
zh_hans: 此文件夹为空
zh_hant: 此資料夾為空

source: This invite expired %@.
ko: 이 초대는 %@에 만료되었습니다.
ru: Срок действия этого приглашения истек %@.
zh_hans: 此邀请已于 %@ 过期。
zh_hant: 此邀請已於 %@ 過期。

source: This is how your agent will look in the grid.
ko: 이것은 그리드에 에이전트가 표시되는 모습입니다.
ru: Вот как ваш агент будет выглядеть в сетке.
zh_hans: 这就是你的智能体在网格中的样子。
zh_hant: 這就是你的智能體在網格中的樣子。

source: This is injected before the system prompt on each message
ko: 이것은 각 메시지의 시스템 프롬프트 앞에 삽입됩니다
ru: Это вводится перед системным промптм для каждого сообщения.
zh_hans: 这会在每条消息的系统提示词前注入
zh_hant: 這會在每條消息的系統提示詞前注入

source: This is the exact text and destination; nothing else is added or removed.
ko: 이것이 정확한 텍스트와 대상입니다. 추가되거나 제거되는 내용은 없습니다.
ru: Это точный текст и назначение; ничего больше не добавляется и не удаляется.
zh_hans: 这就是确切的文本和目标；不会再添加或删除任何内容。
zh_hant: 這就是確切的文字和目標；不會再新增或刪除任何內容。

source: This looks like an MCP server
ko: MCP 서버로 보입니다
ru: Похоже, это MCP-сервер
zh_hans: 这看起来是一个 MCP 服务器
zh_hant: 這看起來是一個 MCP 伺服器

source: This Mac's Messages app, allowlisted chats only
ko: 이 Mac의 메시지 앱, 허용 목록에 있는 채팅만
ru: Приложение «Сообщения» этого Mac, только чаты из списка разрешённых
zh_hans: 此 Mac 的“信息”应用，仅限允许列表中的聊天

source: This model is outdated. Click to switch to a newer version.
ko: 이 모델은 오래되었습니다. 클릭하여 최신 버전으로 전환하세요.
ru: Эта модель устарела. Нажмите, чтобы переключиться на более новую версию.
zh_hans: 此模型已过时。点击切换到更新版本。
zh_hant: 此模型已過時。點擊切換到更新版本。

source: This only applies to this chat.
ko: 이것은 이 채팅에만 적용됩니다.
ru: Это касается только этого чата.
zh_hans: 这仅适用于本次对话。
zh_hant: 這僅適用於本次對話。

source: This peer runs an older Osaurus without the Secure Channel. Agent chat is refused until it upgrades — no plaintext fallback.
ko: 이 피어는 보안 채널이 없는 이전 버전의 Osaurus를 실행 중입니다. 업그레이드할 때까지 에이전트 채팅이 거부되며, 일반 텍스트 폴백이 없습니다.
ru: Этот одноранговый узел использует более старую версию Osaurus без безопасного канала. Чат агента отклоняется до тех пор, пока он не будет обновлен — без резервного варианта незашифрованного текста.
zh_hans: 对方运行的是不支持安全通道的旧版 Osaurus。在其升级之前，智能体聊天将被拒绝——不会回退到明文。
zh_hant: 對方運行的是不支持安全通道的舊版 Osaurus。在其升級之前，智能體聊天將被拒絕——不會回退到明文。

source: This peer will lose access immediately. Their access key will be revoked.
ko: 이 피어는 즉시 액세스 권한을 잃게 됩니다. 액세스 키가 취소됩니다.
ru: Этот узел немедленно потеряет доступ. Их ключ доступа будет отозван.
zh_hans: 该用户将立即失去访问权限，其访问密钥将被吊销。
zh_hant: 該用戶將立即失去訪問權限，其訪問密鑰將被吊銷。

source: This permanently deletes the plugin's installed dylib, manifest, and per-agent secrets from disk. The host will stop attempting to load it on every launch — the only way to escape a crash-looping plugin without editing files by hand. You can reinstall it later from the Tools manager.
ko: 플러그인에 설치된 dylib, 매니페스트 및 에이전트별 비밀을 디스크에서 영구적으로 삭제합니다. 호스트는 매 시작 시 플러그인 로드 시도를 중지합니다. 파일을 직접 편집하지 않고 충돌이 반복되는 플러그인을 벗어나는 유일한 방법입니다. 나중에 도구 관리자에서 다시 설치할 수 있습니다.
ru: Это навсегда удалит с диска установленную библиотеку dylib, манифест и секреты каждого агента. Хост прекратит попытки загрузить его при каждом запуске — единственный способ избежать зацикливания плагина без обезличивания файлов вручную. Вы можете переустановить его позже из диспетчера инструментов.
zh_hans: 这将从磁盘上永久删除该插件已安装的动态库（dylib）、清单文件以及每个智能体的密钥。宿主将在每次启动时停止尝试加载该插件——这是无需手动编辑文件就能摆脱导致崩溃循环的插件的唯一方法。你稍后可以通过“工具管理器”重新安装它。
zh_hant: 這將從磁盤上永久刪除該插件已安裝的動態庫（dylib）、清單文件以及每個智能體的密鑰。宿主將在每次啓動時停止嘗試加載該插件——這是無需手動編輯文件就能擺脫導致崩潰循環的插件的唯一方法。您稍後可以通過「工具管理器」重新安裝它。

source: This permanently deletes the selected memory row and removes its vector document when present.
ko: 선택한 메모리 행을 영구적으로 삭제하고, 있는 경우 벡터 문서도 제거합니다.
ru: Это безвозвратно удалит выбранную строку памяти и удалит ее векторный документ, если он присутствует.
zh_hans: 该操作会永久删除选中的记忆行，如果存在对应的向量文档，也会同步移除。
zh_hant: 該操作會永久刪除選中的記憶行，如果存在對應的向量文檔，也會同步移除。

source: This plugin declared configuration options. Non-sensitive values are stored locally; sensitive ones are kept in the system Keychain.
ko: 이 플러그인은 구성 옵션을 선언했습니다. 민감하지 않은 값은 로컬에 저장되고, 민감한 값은 시스템 키체인에 보관됩니다.
ru: Этот плагин объявил параметры конфигурации. Неконфиденциальные значения хранятся локально; чувствительные хранятся в системе «Связка ключей».
zh_hans: 此插件声明了配置选项。非敏感值存储在本地；敏感值保存在系统钥匙串中。
zh_hant: 此插件聲明瞭設定選項。非敏感值存儲在本地；敏感值保存在系統鑰匙串中。

source: This plugin declared options you can configure (%lld field(s)).
ko: 이 플러그인은 구성할 수 있는 옵션(%lld개 필드)을 선언했습니다.
ru: В этом плагине объявлены параметры, которые вы можете настроить (поля %lld).
zh_hans: 此插件声明了你可以配置的选项（%lld 个字段）。
zh_hant: 此插件聲明瞭你可以設定的選項（%lld 個字段）。

source: This plugin declared: %@. Osaurus stores the metadata but does not yet execute these surfaces.
ko: 이 플러그인은 %@을(를) 선언했습니다. Osaurus는 메타데이터를 저장하지만 아직 이 표면을 실행하지 않습니다.
ru: Плагин объявил: %@. Osaurus сохраняет метаданные, но пока не выполняет эти поверхности.
zh_hans: 此插件声明了：%@。Osaurus 会存储其元数据，但尚未执行这些接口。
zh_hant: 此插件聲明了：%@。Osaurus 會存儲其元數據，但尚未執行這些接口。

source: This plugin isn't in the bundled catalog yet. Install to import its skills, agents, commands, and MCP servers, or open the homepage to learn more.
ko: 이 플러그인은 아직 번들 카탈로그에 없습니다. 스킬, 에이전트, 명령 및 MCP 서버를 가져오려면 설치하거나, 자세한 내용을 알아보려면 홈페이지를 여세요.
ru: Этого плагина ещё нет во встроенном каталоге. Установите его, чтобы импортировать навыки, агентов, команды и MCP-серверы, или откройте домашнюю страницу, чтобы узнать больше.
zh_hans: 此插件尚未收录在内置目录中。安装即可导入其技能、智能体、命令和 MCP 服务器，或打开主页以了解更多。
zh_hant: 此插件尚未收錄在內置目錄中。安裝即可導入其技能、智能體、命令和 MCP 服務器，或打開主頁以瞭解更多。

source: This plugin needs your approval before it can load.
ko: 이 플러그인을 로드하려면 승인이 필요합니다.
ru: Этот плагин требует вашего одобрения, прежде чем он сможет загрузиться.
zh_hans: 此插件需要你的批准后才能加载。
zh_hant: 此插件需要你的批准後才能加載。

source: This plugin requires credentials to function properly.
ko: 이 플러그인이 제대로 작동하려면 자격 증명이 필요합니다.
ru: Для корректной работы этого плагина нужны учётные данные.
zh_hans: 此插件需要凭据才能正常工作。
zh_hant: 此插件需要憑據才能正常工作。

source: This plugin requires credentials to function. Your secrets are stored securely in the system Keychain.
ko: 이 플러그인이 작동하려면 자격 증명이 필요합니다. 비밀은 시스템 키체인에 안전하게 저장됩니다.
ru: Для работы этого плагина нужны учётные данные. Секреты надёжно хранятся в системной Связке ключей.
zh_hans: 此插件需要凭据才能运行。你的密钥会安全地存储在系统钥匙串中。
zh_hant: 此插件需要憑據才能運行。你的密鑰會安全地存儲在系統鑰匙串中。

source: This remote agent is no longer available.
ko: 이 원격 에이전트는 더 이상 사용할 수 없습니다.
ru: Этот удалённый агент больше недоступен.
zh_hans: 此远程智能体已不再可用。
zh_hant: 此遠程智能體已不再可用。

source: This removes the collection and its search index from Osaurus. The folder and its files on disk are not touched.
ko: 이 작업은 Osaurus에서 컬렉션과 검색 색인을 제거합니다. 디스크의 폴더와 파일은 그대로 유지됩니다.
ru: Это удалит коллекцию и её поисковый индекс из Osaurus. Папка и её файлы на диске останутся нетронутыми.
zh_hans: 这将从 Osaurus 中移除该集合及其搜索索引。磁盘上的文件夹及其文件不会受到影响。
zh_hant: 這將從 Osaurus 中移除該集合及其搜尋索引。磁碟上的資料夾及其檔案不會受到影響。

source: This removes the memory from future recall while keeping the row available for diagnostics.
ko: 이 작업은 진단을 위해 행을 유지하면서 향후 회상에서 메모리를 제거합니다.
ru: Это удаляет память из будущего вызова, сохраняя при этом строку доступной для диагностики.
zh_hans: 这会将记忆从未来检索中移除，同时保留该行以便诊断。
zh_hant: 這會將記憶從未來檢索中移除，同時保留該行以便診斷。

source: This removes this response from the conversation. It won't be sent to the model on later turns.
ko: 이 응답을 대화에서 삭제합니다. 이후 대화에서 모델에 전송되지 않습니다.
ru: Этот ответ будет удалён из беседы. В последующих запросах он не будет отправляться модели.
zh_hans: 这会将此回复从对话中删除。在后续对话中不会发送给模型。
zh_hant: 這會將此回覆從對話中刪除。在後續對話中不會傳送給模型。

source: This repo did not pass the MLX-compatible metadata/file check. Use an MLX, MXFP, JANG, JANGTQ, or TurboQuant repo with config, tokenizer, and model weights.
ko: 이 저장소는 MLX 호환 메타데이터/파일 검사를 통과하지 못했습니다. 구성, 토크나이저 및 모델 가중치가 포함된 MLX, MXFP, JANG, JANGTQ 또는 TurboQuant 저장소를 사용하세요.
ru: Этот репозиторий не прошёл проверку метаданных и файлов на совместимость с MLX. Используйте репозиторий MLX, MXFP, JANG, JANGTQ или TurboQuant с конфигурацией, токенизатором и весами модели.
zh_hans: 此仓库未通过 MLX 兼容性元数据/文件检查。请使用包含配置、分词器和模型权重的 MLX、MXFP、JANG、JANGTQ 或 TurboQuant 仓库。
zh_hant: 此倉庫未通過 MLX 兼容性元數據/文件檢查。請使用包含配置、分詞器和模型權重的 MLX、MXFP、JANG、JANGTQ 或 TurboQuant 倉庫。

source: This response is part of a conversation summary, so deleting it may affect the meaning of later turns.
ko: 이 응답은 대화 요약의 일부이므로 삭제하면 이후 대화의 의미에 영향을 줄 수 있습니다.
ru: Этот ответ входит в сводку беседы, поэтому его удаление может повлиять на смысл последующих сообщений.
zh_hans: 此回复是对话摘要的一部分，删除它可能会影响后续对话的含义。
zh_hant: 此回覆是對話摘要的一部分，刪除它可能會影響後續對話的含義。

source: This room was turned off — for example its channel was removed, or it arrived from an imported file. Turn it back on to use it again.
ko: 이 룸은 꺼져 있습니다. 예를 들어 채널이 제거되었거나 가져온 파일에서 생성된 경우입니다. 다시 사용하려면 다시 켜세요.
ru: Эта комната была выключена — например, её канал удалён или она пришла из импортированного файла. Включите её снова, чтобы использовать.
zh_hans: 此房间已被关闭——例如其频道已被移除，或它来自导入的文件。重新开启即可再次使用。
zh_hant: 此房間已被關閉——例如其頻道已被移除，或它來自匯入的檔案。重新開啟即可再次使用。

source: This server doesn't require authentication.
ko: 이 서버는 인증이 필요하지 않습니다.
ru: Этот сервер не требует аутентификации.
zh_hans: 此服务器不需要身份验证。
zh_hant: 此服務器不需要身份驗證。

source: This server rejected the request as unauthorized. Paste an API token to retry.
ko: 이 서버가 권한 없음으로 요청을 거부했습니다. 다시 시도하려면 API 토큰을 붙여넣으세요.
ru: Этот сервер отклонил запрос как неавторизованный. Вставьте токен API, чтобы повторить попытку.
zh_hans: 此服务器以未授权为由拒绝了该请求。请粘贴 API 令牌以重试。
zh_hant: 此服務器以未授權爲由拒絕了該請求。請粘貼 API 令牌以重試。

source: This server requires OAuth sign in to provide tools.
ko: 이 서버에서 도구를 제공하려면 OAuth 로그인이 필요합니다.
ru: Этот сервер требует входа OAuth для предоставления инструментов.
zh_hans: 此服务器需要 OAuth 登录才能提供工具。
zh_hant: 此服務器需要 OAuth 登錄才能提供工具。

source: This session
ko: 이 세션
ru: Эта сессия
zh_hans: 当前会话
zh_hant: 當前會話

source: This text is inserted into the chat input when you select the command. You continue typing after it.
ko: 이 텍스트는 명령을 선택할 때 채팅 입력에 삽입됩니다. 이어서 계속 입력할 수 있습니다.
ru: Этот текст вставляется во ввод чата при выборе команды. Вы продолжаете печатать после него.
zh_hans: 当你选择该命令时，这段文本会被插入到聊天输入框中。你可以在其后继续输入。
zh_hant: 當你選擇該命令時，這段文本會被插入到聊天輸入框中。你可以在其後繼續輸入。

source: This tool will be automatically allowed to run without prompting in the future. You can change this in the Tools settings.
ko: 이 도구는 향후 확인 메시지 없이 자동으로 실행되도록 허용됩니다. 도구 설정에서 이를 변경할 수 있습니다.
ru: В будущем этому инструменту будет разрешен автоматический запуск без запроса. Вы можете изменить это в настройках «Инструменты».
zh_hans: 此工具将在未来自动允许运行而不提示。你可以在工具设置中更改此设置。
zh_hant: 此工具將在未來自動允許運行而不提示。您可以在工具設置中更改此設置。

source: This URL answers like an MCP server, not a chat completions API. Add it under Tools > Connections instead of as an API provider.
ko: 이 URL은 채팅 완성 API가 아니라 MCP 서버처럼 응답합니다. API 제공자 대신 도구 > 연결에서 추가하세요.
ru: Этот URL отвечает как MCP-сервер, а не как API чат-комплишенов. Добавьте его в разделе «Инструменты > Подключения», а не как API-провайдера.
zh_hans: 此 URL 的响应方式像 MCP 服务器，而不是聊天补全 API。请在“工具 > 连接”中添加它，而不是作为 API 提供商。
zh_hant: 此 URL 的回應方式像 MCP 伺服器，而不是聊天補全 API。請在「工具 > 連接」中新增它，而不是作為 API 提供者。

source: This URL answers like an MCP server, not a chat completions API. Osaurus can add it as an MCP connection instead — the URL and token you entered will be carried over.
ko: 이 URL은 채팅 완성 API가 아니라 MCP 서버처럼 응답합니다. Osaurus가 이를 MCP 연결로 대신 추가할 수 있으며, 입력한 URL과 토큰은 그대로 이어집니다.
ru: Этот URL отвечает как MCP-сервер, а не как API чат-комплишенов. Osaurus может добавить его как MCP-подключение — введённые URL и токен будут перенесены.
zh_hans: 此 URL 的响应方式像 MCP 服务器，而不是聊天补全 API。Osaurus 可以将它添加为 MCP 连接——你输入的 URL 和令牌将被保留。
zh_hant: 此 URL 的回應方式像 MCP 伺服器，而不是聊天補全 API。Osaurus 可以將它新增為 MCP 連接——你輸入的 URL 和令牌將被保留。

source: This value is stored securely
ko: 이 값은 안전하게 저장됩니다
ru: Это значение надёжно хранится
zh_hans: 此值已安全存储
zh_hant: 此值已安全存儲

source: This walks every chat session in your history, buffers their turns into pending_signals, then runs distillation. It can take a while if you have hundreds of sessions — each one is a single LLM call against your core model. Already-distilled sessions are skipped.
ko: 기록에 있는 모든 채팅 세션을 탐색하고 pending_signals로 턴을 버퍼링한 다음 증류를 실행합니다. 수백 개의 세션이 있는 경우 시간이 걸릴 수 있습니다. 각 세션은 코어 모델에 대한 단일 LLM 호출입니다. 이미 증류된 세션은 건너뜁니다.
ru: Он просматривает каждый сеанс чата в вашей истории, буферизует их ходы в pending_signals, а затем запускает дистилляцию. Если у вас сотни сеансов, это может занять некоторое время — каждый из них представляет собой один вызов LLM вашей базовой модели. Уже очищенные сеансы пропускаются.
zh_hans: 这会遍历你历史中的每一个聊天会话，将它们的回合缓冲到 pending_signals 中，然后进行蒸馏。如果你有数百个会话，这可能需要一些时间——每个会话都是对你的核心模型的一次单独的 LLM 调用。已经蒸馏过的会话会被跳过。
zh_hant: 這會遍歷你歷史中的每一個聊天會話，將它們的回合緩衝到pending_signals中，然後進行蒸餾。如果你有數百個會話，這可能需要一些時間——每個會話都是對你的核心模型的一次單獨的LLM調用。已經蒸餾過的會話會被跳過。

source: This will create a public URL for this agent via agent.osaurus.ai. Anyone with the URL can send requests to your local server. Your access keys still protect the API endpoints.
ko: 이 작업은 agent.osaurus.ai를 통해 이 에이전트의 공개 URL을 생성합니다. URL이 있는 사람은 누구나 로컬 서버로 요청을 보낼 수 있습니다. 액세스 키는 여전히 API 엔드포인트를 보호합니다.
ru: Это создаст общедоступный URL для этого агента через агент.osaurus.ai. Любой, у кого есть URL, может отправлять запросы на ваш локальный сервер. Ваши ключи доступа по-прежнему защищают эндпоинты API.
zh_hans: 这将通过 agent.osaurus.ai 为此智能体创建一个公开 URL。任何拥有该 URL 的人都可以向你的本地服务端发送请求。你的访问密钥仍会保护 API 端点。
zh_hant: 這將通過 agent.osaurus.ai 爲此智能體創建一個公開 URL。任何擁有該 URL 的人都可以向你的本地服務器發送請求。你的訪問密鑰仍會保護 API 端點。

source: This will cryptographically verify both devices. The remote device will show an approval prompt.
ko: 이 작업은 암호화 방식으로 두 기기를 모두 확인합니다. 원격 기기에 승인 메시지가 표시됩니다.
ru: Это позволит криптографически проверить оба устройства. На удаленном устройстве отобразится запрос на подтверждение.
zh_hans: 这将对两台设备进行加密验证。远程设备会显示一个批准提示。
zh_hant: 這將對兩臺設備進行加密驗證。遠程設備會顯示一個批准提示。

source: This will destroy the container and re-provision from scratch. Installed packages and sandbox plugin state will be lost.
ko: 이 작업은 컨테이너를 파괴하고 처음부터 다시 프로비저닝합니다. 설치된 패키지 및 샌드박스 플러그인 상태가 손실됩니다.
ru: Это приведет к уничтожению контейнера и его повторному предоставлению с нуля. Установленные пакеты и состояние плагина песочницы будут потеряны.
zh_hans: 这将销毁容器并从头重新配置。已安装的软件包和沙盒插件状态将丢失。
zh_hant: 這將銷毀容器並從頭重新配置。已安裝的軟件包和沙盒插件狀態將丟失。

source: This will permanently delete all your data, including chat history, agents, memory, and your identity keys. This action cannot be undone and the application will close.
ko: 채팅 기록, 에이전트, 메모리 및 ID 키를 포함한 모든 데이터가 영구적으로 삭제됩니다. 이 작업은 취소할 수 없으며 앱이 닫힙니다.
ru: Это приведет к безвозвратному удалению всех ваших данных, включая историю чатов, агентов, память и ваши идентификационные ключи. Это действие невозможно отменить, и приложение закроется.
zh_hans: 这将永久删除你的所有数据，包括聊天历史、智能体、记忆和身份密钥。此操作无法撤销，应用将会关闭。
zh_hant: 這將永久刪除你的所有數據，包括聊天歷史、智能體、記憶和身份密鑰。此操作無法撤銷，應用將會關閉。

source: This will permanently delete your identity, all pinned facts, episodes, and conversation history. This cannot be undone.
ko: 신원, 고정된 모든 사실, 에피소드 및 대화 기록이 영구적으로 삭제됩니다. 이 작업은 취소할 수 없습니다.
ru: Это приведет к безвозвратному удалению вашей идентификации, всех закреплённых фактов, эпизодов и истории разговоров. Это невозможно отменить.
zh_hans: 这将永久删除你的身份、所有固定的事实、情景和对话历史记录。此操作无法撤销。
zh_hant: 這將永久刪除您的身份、所有固定的事實、劇集和對話歷史記錄。此操作無法撤銷。

source: This will remove '%@' and disconnect any active sessions.
ko: '%@'을(를) 제거하고 활성 세션의 연결을 끊습니다.
ru: Это удалит «%@» и отключит все активные сеансы.
zh_hans: 这将删除“%@”并断开所有活动会话。
zh_hant: 這將刪除「%@」並斷開所有活動會話。

source: This will remove the provider and all its tools. This cannot be undone.
ko: 이 작업은 제공자와 모든 도구를 제거합니다. 이 작업은 취소할 수 없습니다.
ru: Это приведет к удалению провайдера и всех его инструментов. Это невозможно отменить.
zh_hans: 这将删除该提供商及其所有工具。此操作无法撤销。
zh_hant: 這將刪除該提供商及其所有工具。此操作無法撤銷。

source: This will reset the sandbox and re-provision from scratch. Sandbox plugin state will be lost.
ko: 샌드박스를 재설정하고 처음부터 다시 프로비저닝합니다. 샌드박스 플러그인 상태가 손실됩니다.
ru: Песочница будет сброшена и подготовлена заново. Состояние плагинов песочницы будет потеряно.
zh_hans: 这将重置沙盒并从头重新配置。沙盒插件状态将丢失。
zh_hant: 這將重置沙盒並從頭重新配置。沙盒插件狀態將遺失。

source: This will stop and remove the container entirely. You can set it up again later.
ko: 이 작업은 컨테이너를 완전히 중지하고 제거합니다. 나중에 다시 설정할 수 있습니다.
ru: Это остановит и полностью удалит контейнер. Позже вы сможете настроить его снова.
zh_hans: 这会完全停止并移除容器。你稍后可以重新设置。
zh_hant: 這會完全停止並移除容器。你稍後可以重新設置。

source: This will stop and remove the sandbox entirely. You can set it up again later.
ko: 샌드박스를 완전히 중지하고 제거합니다. 나중에 다시 설정할 수 있습니다.
ru: Песочница будет полностью остановлена и удалена. Позже её можно настроить снова.
zh_hans: 这将完全停止并移除沙盒。你可以稍后重新设置。
zh_hant: 這將完全停止並移除沙盒。您可以稍後重新設定。

source: Thought
ko: 생각
ru: Мысль
zh_hans: 思考
zh_hant: 思考

source: Thought for
ko: 생각한 시간
ru: Мысль для
zh_hans: 思考用时
zh_hant: 思考用時

source: Thread
ko: 스레드
ru: Тред
zh_hans: 线程
zh_hant: 討論串

source: Thread ID (optional)
ko: 스레드 ID(선택 사항)
ru: ID треда (необязательно)
zh_hans: 线程 ID（可选）
zh_hant: 討論串 ID（可選）

source: Threaded Replies
ko: 스레드 답장
ru: Ответы в тредах
zh_hans: 话题内回复

source: Throw it away and start fresh from the Sandbox tab — your Mac is untouched.
ko: 그것을 버리고 샌드박스 탭에서 새로 시작하세요. Mac에는 아무런 영향을 주지 않습니다.
ru: Удалите песочницу и начните заново на вкладке «Песочница» — Mac не будет затронут.
zh_hans: 丢弃它并从“沙盒”标签页重新开始——你的 Mac 不会受到任何影响。
zh_hant: 丟棄它並從“沙盒”標籤頁重新開始——你的 Mac 不會受到任何影響。

# Ticket #%lld: %@
source: Ticket #%1$lld: %2$@
ko: 티켓 #%lld: %@
ru: Тикет #%lld: %@
zh_hans: 工单 #%lld：%@
zh_hant: 工單 #%lld：%@

source: Tied LM Head Codec
ko: Tied LM Head 코덱
ru: Кодек головы привязан LM
zh_hans: 绑定 LM Head 编解码器
zh_hant: 綁定 LM Head 編解碼器

source: Tight fit
ko: 여유 공간 부족
ru: Плотно прилегает
zh_hans: 空间紧张
zh_hant: 勉強夠用

source: Tight Fit
ko: 여유 공간 부족
ru: Плотно прилегает
zh_hans: 空间紧张
zh_hant: 緊湊適配

source: Tighter cap for the unauthenticated /pair endpoint. Should stay small.
ko: 인증되지 않은 /pair 엔드포인트에 대한 더 엄격한 제한입니다. 작게 유지해야 합니다.
ru: Более жесткое ограничение для неаутентифицированной эндпоинта /pair. Должен оставаться небольшим.
zh_hans: 对未经身份验证的 /pair 端点设置更严格的限制。应保持较小值。
zh_hant: 對未經身份驗證的 /pair 端點設置更嚴格的限制。應保持較小值。

source: Tile
ko: 타일
ru: Плитка
zh_hans: 平铺
zh_hant: 平鋪

source: Time
ko: 시간
ru: Время
zh_hans: 时间
zh_hant: 時間

source: TIME
ko: 시간
ru: ВРЕМЯ
zh_hans: 时间
zh_hant: 時間

source: Time to cancel before a chat message is automatically sent
ko: 채팅 메시지가 자동으로 전송되기 전에 취소할 수 있는 시간
ru: Время отменить, прежде чем сообщение чата будет отправлено автоматически.
zh_hans: 聊天消息自动发送前可用于取消的时间
zh_hant: 聊天消息自動發送前可用於取消的時間

source: Time to cancel before message is automatically sent
ko: 메시지가 자동으로 전송되기 전에 취소할 수 있는 시간
ru: Время отмены до автоматической отправки сообщения
zh_hans: 消息自动发送前可取消的时间
zh_hant: 消息自動發送前可取消的時間

source: Timeout
ko: 시간 초과
ru: Тайм-аут
zh_hans: 超时
zh_hant: 超時

source: Timestamps
ko: 타임스탬프
ru: Временные метки
zh_hans: 时间戳
zh_hant: 時間戳

source: Title
ko: 제목
ru: Заголовок
zh_hans: 标题
zh_hant: 標題

source: to
ko: 까지
ru: к
zh_hans: 至
zh_hant: 至

source: to send
ko: 전송하려면
ru: отправить
zh_hans: 发送
zh_hant: 發送

source: Toast Position
ko: 토스트 위치
ru: Позиция всплывающих уведомлений
zh_hans: Toast 位置
zh_hant: Toast 位置

source: Todo
ko: 할 일
ru: Тодо
zh_hans: 待办
zh_hant: 待辦

source: Together AI, LM Studio, and more
ko: Together AI, LM Studio 및 기타
ru: Вместе ИИ, LM Студия и другие
zh_hans: Together AI、LM Studio 等
zh_hant: Together AI、LM Studio 等

source: toggle below
ko: 아래 토글
ru: переключиться ниже
zh_hans: 下方的开关
zh_hant: 下方的開關

source: Toggle model reasoning mode
ko: 모델 추론 모드 전환
ru: Переключить режим рассуждения модели
zh_hans: 切换模型推理模式
zh_hant: 切換模型推理模式

source: Toggle Voice Detection
ko: 음성 감지 전환
ru: Переключить обнаружение голоса
zh_hans: 切换语音检测
zh_hant: 切換語音檢測

source: Token required
ko: 토큰 필요
ru: Требуется токен
zh_hans: 需要令牌
zh_hant: 需要令牌

source: Token usage
ko: 토큰 사용량
ru: Использование токена
zh_hans: Token 使用量
zh_hant: 詞元使用量

source: Tokenizer missing
ko: 토크나이저 누락됨
ru: Токенайзер отсутствует
zh_hans: 分词器缺失
zh_hant: 分詞器缺失

source: tokens
ko: 토큰
ru: токены
zh_hans: Token
zh_hant: Token

source: Tokens
ko: 토큰
ru: Токены
zh_hans: Token
zh_hant: 詞元

source: tokens %lld
ko: 토큰 %lld개
ru: токены %lld
zh_hans: Token %lld
zh_hant: 詞元 %lld

source: Tokens are refreshed before HTTP MCP discovery.
ko: HTTP MCP 검색 전에 토큰이 새로 고쳐집니다.
ru: Токены обновляются перед обнаружением HTTP MCP.
zh_hans: 令牌会在 HTTP MCP 发现之前刷新。
zh_hant: 在發現HTTP MCP之前刷新了令牌。

source: Tokens Per Chunk
ko: 청크당 토큰
ru: Токенов на чанк
zh_hans: 每块 Token 数
zh_hant: 每塊令牌數

source: Tokens per paged block.
ko: 페이징된 블록당 토큰입니다.
ru: Токенов на постраничный блок.
zh_hans: 每个分页块包含的 Token 数。
zh_hant: 每個分頁塊包含的 token 數。

source: Too Large
ko: 너무 큼
ru: Слишком большой
zh_hans: 过大
zh_hant: 太大

source: Too large for this Mac
ko: 이 Mac에 비해 너무 큼
ru: Слишком большой для этого Mac
zh_hans: 对此 Mac 而言过大
zh_hant: 對此 Mac 而言過大

source: Too many attempts. Please wait before trying again.
ko: 시도 횟수가 너무 많습니다. 잠시 기다린 후 다시 시도하세요.
ru: Слишком много попыток. Подождите и повторите попытку.
zh_hans: 尝试次数过多。请稍后重试。
zh_hant: 嘗試次數過多。請稍後再試。

source: Tool
ko: 도구
ru: Инструмент
zh_hans: 工具
zh_hant: 工具

# Tool '%@' exceeded the %llds execution budget.
source: Tool '%1$@' exceeded the %2$llds execution budget.
ko: 도구 '%1$@'이(가) %2$lld초의 실행 예산을 초과했습니다.
ru: Инструмент «%1$@» превысил бюджет исполнения %2$lld.
zh_hans: 工具“%1$@”超过了 %2$lld 秒的执行预算。
zh_hant: 工具「%1$@」超過了%2$lld秒的執行預算。

source: Tool '%@' was cancelled.
ko: '%@' 도구가 취소되었습니다.
ru: Инструмент «%@» был отменен.
zh_hans: 工具“%@”已取消。
zh_hant: 工具「%@」已取消。

source: Tool Call Timeout
ko: 도구 호출 시간 초과
ru: Тайм-аут вызова инструмента
zh_hans: 工具调用超时
zh_hant: 工具調用超時

source: Tool Calls
ko: 도구 호출
ru: Вызовы инструментов
zh_hans: 工具调用
zh_hant: 工具調用

source: Tool discovery is running with a %llds timeout.
ko: 도구 검색이 %lld초의 시간 초과로 실행 중입니다.
ru: Обнаружение инструментов выполняется с тайм-аутом %llds.
zh_hans: 工具发现正在运行，超时时间为 %lld 秒。
zh_hant: 工具發現正在運行，超時時間爲 %lld 秒。

source: Tool Exposure Control Center
ko: 도구 노출 제어 센터
ru: Центр контроля воздействия инструментов
zh_hans: 工具暴露控制中心
zh_hant: 工具暴露控制中心

source: tool is not registered; install or enable the plugin/provider that owns it
ko: 도구가 등록되지 않았습니다. 해당 도구를 소유한 플러그인/제공자를 설치하거나 사용하도록 설정하세요.
ru: инструмент не зарегистрирован; установить или включить плагин/провайдер, которому он принадлежит
zh_hans: 工具未注册；安装或启用拥有它的插件/提供商
zh_hant: 工具未註冊；安裝或啓用擁有它的插件/提供商

source: Tool Parser Override
ko: 도구 파서 재정의
ru: Переопределение анализатора инструментов
zh_hans: 工具解析器覆盖
zh_hant: 工具解析器覆蓋

source: Tool Permission
ko: 도구 권한
ru: Разрешение инструмента
zh_hans: 工具权限
zh_hant: 工具權限

source: Tool Permissions
ko: 도구 권한
ru: Разрешения инструмента
zh_hans: 工具权限
zh_hant: 工具權限

source: Tools
ko: 도구
ru: Инструменты
zh_hans: 工具
zh_hant: 工具

source: Tools (%lld)
ko: 도구(%lld)
ru: Инструменты (%lld)
zh_hans: 工具 (%lld)
zh_hant: 工具 (%lld)

source: Tools & Templates
ko: 도구 및 템플릿
ru: Инструменты и шаблоны
zh_hans: 工具与模板
zh_hant: 工具與模板
